<!-- dflook/terraform-github-actions {"workspace":"default","backend":"42eb38c192fa868799d1cdfae6e64fc8a9e1097c3c9d865a7150e70547b31d37","backend_type":"azurerm"} -->
Terraform plan in __.__
<details>
<summary>Plan: 1 to add, 3 to change, 1 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.cassandra.module.cassandra.data.local_file.node_ips will be read during apply
  # (config refers to values not yet known)
 <= data "local_file" "node_ips"  {
      ~ content        = jsonencode(
            [
              - {
                  - ipAddress = "172.16.1.5"
                },
              - {
                  - ipAddress = "172.16.1.6"
                },
              - {
                  - ipAddress = "172.16.1.7"
                },
            ]
        ) -> (known after apply)
      ~ content_base64 = "WwogIHsKICAgICJpcEFkZHJlc3MiOiAiMTcyLjE2LjEuNSIKICB9LAogIHsKICAgICJpcEFkZHJlc3MiOiAiMTcyLjE2LjEuNiIKICB9LAogIHsKICAgICJpcEFkZHJlc3MiOiAiMTcyLjE2LjEuNyIKICB9Cl0K" -> (known after apply)
      ~ id             = "****************************************" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.cassandra.module.cassandra.azurerm_lb_backend_address_pool_address.this[0] will be updated in-place
  ~ resource "azurerm_lb_backend_address_pool_address" "this" {
        id                      = "/subscriptions/02b44a0d-f98e-407e-b0c1-7d394305857e/resourceGroups/cassandra-rg/providers/Microsoft.Network/loadBalancers/cassandra-cl-lb/backendAddressPools/cassandra-cl-nodes/addresses/node-1"
      ~ ip_address              = "172.16.1.5" -> (known after apply)
        name                    = "node-1"
        # (2 unchanged attributes hidden)
    }

  # module.cassandra.module.cassandra.azurerm_lb_backend_address_pool_address.this[1] will be updated in-place
  ~ resource "azurerm_lb_backend_address_pool_address" "this" {
        id                      = "/subscriptions/02b44a0d-f98e-407e-b0c1-7d394305857e/resourceGroups/cassandra-rg/providers/Microsoft.Network/loadBalancers/cassandra-cl-lb/backendAddressPools/cassandra-cl-nodes/addresses/node-2"
      ~ ip_address              = "172.16.1.6" -> (known after apply)
        name                    = "node-2"
        # (2 unchanged attributes hidden)
    }

  # module.cassandra.module.cassandra.azurerm_lb_backend_address_pool_address.this[2] will be updated in-place
  ~ resource "azurerm_lb_backend_address_pool_address" "this" {
        id                      = "/subscriptions/02b44a0d-f98e-407e-b0c1-7d394305857e/resourceGroups/cassandra-rg/providers/Microsoft.Network/loadBalancers/cassandra-cl-lb/backendAddressPools/cassandra-cl-nodes/addresses/node-3"
      ~ ip_address              = "172.16.1.7" -> (known after apply)
        name                    = "node-3"
        # (2 unchanged attributes hidden)
    }

  # module.cassandra.module.cassandra.null_resource.get_nodes_ips must be replaced
-/+ resource "null_resource" "get_nodes_ips" {
      ~ id       = "******************" -> (known after apply)
      ~ triggers = {
          - "nodes" = "3"
        } -> (known after apply) # forces replacement
    }

Plan: 1 to add, 3 to change, 1 to destroy.
```
</details>

:white_check_mark: Plan applied in [terraform #6](https://github.com/hybridaccess/nonprod-test-infra/actions/runs/2602865660)